Revit 2026 API

# ItemFactoryBaseNewFamilyInstances2 Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> NewFamilyInstances2(
	List<FamilyInstanceCreationData> dataList
)
```
```vb
Public Function NewFamilyInstances2 (
	dataList As List(Of FamilyInstanceCreationData)
) As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ NewFamilyInstances2(
	List<FamilyInstanceCreationData^>^ dataList
)
```
```fsharp
member NewFamilyInstances2 :
        dataList : List<FamilyInstanceCreationData> -> ICollection<ElementId>
```

#### Parameters

dataList ListFamilyInstanceCreationData

#### Return Value

ICollectionElementId

#### Reference

ItemFactoryBase Class

Autodesk.Revit.Creation Namespace